#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-acme_repo_B6322198: Preparing import... [id=cdktn-provider-acme]
data.github_team.cdktn-team-cdk-terrain: Reading...
data.github_team.cdktn-team-cdk-terrain: Read complete after 5s [id=15746607]
github_repository.cdktn-provider-acme-go_repo_C1F1650E: Preparing import... [id=cdktn-provider-acme-go]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-acme_repo_secret-alert-prs-slack-webhook-url_9709DD49 will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-alert-prs-slack-webhook-url_9709DD49" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-app-id-alias-PROJEN_APP_ID_233BB8DE will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-app-id-alias-PROJEN_APP_ID_233BB8DE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-app-id_437FD786 will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-app-id_437FD786" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_7F529563 will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_7F529563" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-app-private-key_2BB1FBE8 will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-app-private-key_2BB1FBE8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_9685A7C9 will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_9685A7C9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_BD15C069 will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_BD15C069" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-gh-token_6FA75225 will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-gh-token_6FA75225" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-npm-token_EC270559 will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-npm-token_EC270559" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-twine-password_8CC998B9 will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-twine-password_8CC998B9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-acme_repo_secret-twine-username_D7BB97BB will be created
  + resource "github_actions_secret" "cdktn-provider-acme_repo_secret-twine-username_D7BB97BB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-acme"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-acme_repository-setup_main-protection_64DECEE0 will be created
  + resource "github_branch_protection" "cdktn-provider-acme_repository-setup_main-protection_64DECEE0" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-acme"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-acme-go_repository-setup_auto-approve-label_CF0D62D1 will be created
  + resource "github_issue_label" "cdktn-provider-acme-go_repository-setup_auto-approve-label_CF0D62D1" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-acme-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-acme-go_repository-setup_automerge-label_66C666B7 will be created
  + resource "github_issue_label" "cdktn-provider-acme-go_repository-setup_automerge-label_66C666B7" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-acme-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-acme-go_repository-setup_no-auto-close-label_EABAABED will be created
  + resource "github_issue_label" "cdktn-provider-acme-go_repository-setup_no-auto-close-label_EABAABED" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-acme-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-acme_repository-setup_auto-approve-label_C973DA18 will be created
  + resource "github_issue_label" "cdktn-provider-acme_repository-setup_auto-approve-label_C973DA18" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-acme"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-acme_repository-setup_automerge-label_E7993B63 will be created
  + resource "github_issue_label" "cdktn-provider-acme_repository-setup_automerge-label_E7993B63" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-acme"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-acme_repository-setup_no-auto-close-label_0A5A3A00 will be created
  + resource "github_issue_label" "cdktn-provider-acme_repository-setup_no-auto-close-label_0A5A3A00" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-acme"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-acme-go_repo_C1F1650E will be updated in-place
  # (imported from "cdktn-provider-acme-go")
  ~ resource "github_repository" "cdktn-provider-acme-go_repo_C1F1650E" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "CDK Terrain Go provider bindings for acme."
        etag                        = "W/\"eb469f319cb865986f9c0f03ec37a0a8cc23097f30e414b650681302111b1601\""
        full_name                   = "cdktn-io/cdktn-provider-acme-go"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-acme-go.git"
        has_discussions             = false
      - has_downloads               = true -> null
      ~ has_issues                  = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-acme-go"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-acme-go.git"
        id                          = "cdktn-provider-acme-go"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-acme-go"
        node_id                     = "R_kgDORTtLNQ"
        primary_language            = "Go"
        private                     = false
        repo_id                     = 1161513781
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-acme-go.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-acme-go"
      ~ topics                      = [
          + "acme",
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
      ~ vulnerability_alerts        = true -> false
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.cdktn-provider-acme_repo_B6322198 will be updated in-place
  # (imported from "cdktn-provider-acme")
  ~ resource "github_repository" "cdktn-provider-acme_repo_B6322198" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "Prebuilt CDK Terrain (cdktn) provider for acme."
        etag                        = "W/\"3e64eeb9fdd34b5a2a85148ab3b3a2a1b4b7fcd9149ace25f7a7c369462a6c86\""
        full_name                   = "cdktn-io/cdktn-provider-acme"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-acme.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = true
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-acme"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-acme.git"
        id                          = "cdktn-provider-acme"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-acme"
        node_id                     = "R_kgDORTsu_w"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 1161506559
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-acme.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-acme"
      ~ topics                      = [
          + "acme",
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_dependabot_security_updates.cdktn-provider-acme_dependabot-security_D7AD182D will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-acme_dependabot-security_D7AD182D" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-acme"
    }

  # github_repository_webhook.cdktn-provider-acme-go_repository-setup_slack-webhook_CEB82F00 will be created
  + resource "github_repository_webhook" "cdktn-provider-acme-go_repository-setup_slack-webhook_CEB82F00" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-acme-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-acme_repository-setup_slack-webhook_F1195E42 will be created
  + resource "github_repository_webhook" "cdktn-provider-acme_repository-setup_slack-webhook_F1195E42" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-acme"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-acme-go_repository-setup_managing-team_D6BE8DEE will be created
  + resource "github_team_repository" "cdktn-provider-acme-go_repository-setup_managing-team_D6BE8DEE" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-acme-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-acme_repository-setup_managing-team_5BADD45A will be created
  + resource "github_team_repository" "cdktn-provider-acme_repository-setup_managing-team_5BADD45A" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-acme"
      + team_id    = "15746607"
    }

Plan: 2 to import, 23 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos   = [
      + "github_repository.cdktn-provider-acme_repo_B6322198.ssh_clone_url",
        "github_repository.cdktn-provider-archive_repo_7B884DD9.ssh_clone_url",
        # (19 unchanged elements hidden)
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*